; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v9)
             (pred_7 ?v6 ?v10)
             (pred_8 ?v2 ?v10)
             (pred_12 ?v11 ?v2 )
	     (pred_3 ?v2)
             (pred_5 ?v3)
             (pred_6 ?v6)
             (pred_2 ?v10)
             (pred_11 ?v2)
             (pred_9 ?v6)
             (pred_4 ?v2)
             (pred_1 ))



(:action op_4
:parameters (?v12 ?v13 ?v5 ?v4)
:precondition (and (pred_5 ?v12) (pred_5 ?v13) (pred_6 ?v5) (pred_2 ?v4)
          (pred_10 ?v12 ?v13) (pred_7 ?v5 ?v4)
                   (pred_8 ?v13 ?v4) (pred_3 ?v12) 
                   (pred_11 ?v13) (pred_9 ?v5))
:effect (and  (pred_4 ?v13) (not (pred_11 ?v13))))


(:action op_1
:parameters (?v12 ?v7)
:precondition (and (pred_5 ?v12) (pred_5 ?v7)
               (pred_3 ?v12) (pred_10 ?v12 ?v7) (pred_4 ?v7))
:effect (and (pred_3 ?v7) (not (pred_3 ?v12))))

(:action op_2
:parameters (?v12 ?v5)
:precondition (and (pred_5 ?v12) (pred_6 ?v5) 
                  (pred_3 ?v12) (pred_12 ?v5 ?v12) (pred_1 ))
:effect (and (pred_9 ?v5)
   (not (pred_12 ?v5 ?v12)) (not (pred_1 ))))


(:action op_5
:parameters (?v12 ?v1 ?v8)
:precondition (and (pred_5 ?v12) (pred_6 ?v1) (pred_6 ?v8)
                  (pred_3 ?v12) (pred_9 ?v8) (pred_12 ?v1 ?v12))
:effect (and (pred_9 ?v1) (pred_12 ?v8 ?v12)
        (not (pred_9 ?v8)) (not (pred_12 ?v1 ?v12))))

(:action op_3
:parameters (?v12 ?v5)
:precondition (and (pred_5 ?v12) (pred_6 ?v5) 
                  (pred_3 ?v12) (pred_9 ?v5))
:effect (and (pred_1 ) (pred_12 ?v5 ?v12) (not (pred_9 ?v5)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_17 obj_31 obj_13 obj_07 obj_30 obj_05 obj_29 obj_23 obj_32 obj_19 obj_03 obj_02 obj_25 obj_01 obj_08 obj_09 obj_22 obj_21 obj_12 obj_16 obj_20 obj_14 obj_04 obj_28 obj_06
    obj_27 obj_10 obj_26
    obj_18 obj_24 obj_11 obj_15
    )

    (:init
       (pred_1)

       (pred_5 obj_17)
       (pred_5 obj_31)
       (pred_5 obj_13)
       (pred_5 obj_07)
       (pred_5 obj_30)
       (pred_5 obj_05)
       (pred_5 obj_29)
       (pred_5 obj_23)
       (pred_5 obj_32)
       (pred_5 obj_19)
       (pred_5 obj_03)
       (pred_5 obj_02)
       (pred_5 obj_25)
       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_09)
       (pred_5 obj_22)
       (pred_5 obj_21)
       (pred_5 obj_12)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_28)
       (pred_5 obj_06)
       (pred_2 obj_27)
       (pred_2 obj_10)
       (pred_2 obj_26)
       (pred_6 obj_18)
       (pred_6 obj_24)
       (pred_6 obj_11)
       (pred_6 obj_15)

       (pred_10 obj_17 obj_05)
       (pred_10 obj_17 obj_31)
       (pred_10 obj_31 obj_29)
       (pred_10 obj_31 obj_13)
       (pred_10 obj_31 obj_17)
       (pred_10 obj_13 obj_23)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_31)
       (pred_10 obj_07 obj_32)
       (pred_10 obj_07 obj_30)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_30 obj_07)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_05 obj_17)
       (pred_10 obj_29 obj_02)
       (pred_10 obj_29 obj_23)
       (pred_10 obj_29 obj_31)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_23 obj_25)
       (pred_10 obj_23 obj_32)
       (pred_10 obj_23 obj_13)
       (pred_10 obj_23 obj_29)
       (pred_10 obj_32 obj_01)
       (pred_10 obj_32 obj_19)
       (pred_10 obj_32 obj_07)
       (pred_10 obj_32 obj_23)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_19 obj_32)
       (pred_10 obj_03 obj_09)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_02 obj_22)
       (pred_10 obj_02 obj_25)
       (pred_10 obj_02 obj_29)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_25 obj_21)
       (pred_10 obj_25 obj_01)
       (pred_10 obj_25 obj_23)
       (pred_10 obj_25 obj_02)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_32)
       (pred_10 obj_01 obj_25)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_22)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_22 obj_14)
       (pred_10 obj_22 obj_21)
       (pred_10 obj_22 obj_02)
       (pred_10 obj_22 obj_09)
       (pred_10 obj_21 obj_04)
       (pred_10 obj_21 obj_12)
       (pred_10 obj_21 obj_25)
       (pred_10 obj_21 obj_22)
       (pred_10 obj_12 obj_28)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_21)
       (pred_10 obj_16 obj_06)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_20 obj_14)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_14 obj_04)
       (pred_10 obj_14 obj_22)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_04 obj_28)
       (pred_10 obj_04 obj_21)
       (pred_10 obj_04 obj_14)
       (pred_10 obj_28 obj_06)
       (pred_10 obj_28 obj_12)
       (pred_10 obj_28 obj_04)
       (pred_10 obj_06 obj_16)
       (pred_10 obj_06 obj_28)
       (pred_11 obj_13)
       (pred_11 obj_20)
       (pred_11 obj_12)
       (pred_11 obj_28)
       (pred_8  obj_13 obj_27)
       (pred_8  obj_20 obj_10)
       (pred_8  obj_12 obj_26)
       (pred_8  obj_28 obj_27)
       (pred_4 obj_17)
       (pred_4 obj_31)
       (pred_4 obj_07)
       (pred_4 obj_30)
       (pred_4 obj_05)
       (pred_4 obj_29)
       (pred_4 obj_23)
       (pred_4 obj_32)
       (pred_4 obj_19)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_4 obj_25)
       (pred_4 obj_01)
       (pred_4 obj_08)
       (pred_4 obj_09)
       (pred_4 obj_22)
       (pred_4 obj_21)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_04)
       (pred_4 obj_06)

       (pred_7  obj_18 obj_27)
       (pred_7  obj_24 obj_10)
       (pred_7  obj_11 obj_26)
       (pred_7  obj_15 obj_26)
       (pred_12 obj_18 obj_03)
       (pred_12 obj_24 obj_05)
       (pred_12 obj_11 obj_22)
       (pred_12 obj_15 obj_20)
       (pred_3 obj_23)
    )

    (:goal (and
       (pred_12 obj_18 obj_13)
       (pred_12 obj_24 obj_32)
       (pred_12 obj_11 obj_31)
    ))
(:constraints
  (always (not (pred_3 obj_29)))
)
)

; plan
1. (op_1 obj_23 obj_25)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_25)
   goals met: 0 of 3
2. (op_1 obj_25 obj_02)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_02)
   goals met: 0 of 3
3. (op_1 obj_02 obj_22)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_22)
   goals met: 0 of 3
4. (op_2 obj_22 obj_11)
   deleted: (pred_12 obj_11 obj_22) (pred_1)
   added: (pred_9 obj_11)
   goals met: 0 of 3
5. (op_1 obj_22 obj_02)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_02)
   goals met: 0 of 3
6. (op_1 obj_02 obj_03)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_03)
   goals met: 0 of 3
7. (op_1 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_05)
   goals met: 0 of 3
8. (op_1 obj_05 obj_17)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_17)
   goals met: 0 of 3
9. (op_1 obj_17 obj_31)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_31)
   goals met: 0 of 3
10. (op_3 obj_31 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_1) (pred_12 obj_11 obj_31)
   goals met: 1 of 3
11. (op_1 obj_31 obj_17)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_17)
   goals met: 1 of 3
12. (op_1 obj_17 obj_05)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_05)
   goals met: 1 of 3
13. (op_1 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_03)
   goals met: 1 of 3
14. (op_2 obj_03 obj_18)
   deleted: (pred_12 obj_18 obj_03) (pred_1)
   added: (pred_9 obj_18)
   goals met: 1 of 3
15. (op_1 obj_03 obj_02)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_02)
   goals met: 1 of 3
16. (op_1 obj_02 obj_25)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_25)
   goals met: 1 of 3
17. (op_1 obj_25 obj_23)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_23)
   goals met: 1 of 3
18. (op_4 obj_23 obj_13 obj_18 obj_27)
   deleted: (pred_11 obj_13)
   added: (pred_4 obj_13)
   goals met: 1 of 3
19. (op_1 obj_23 obj_13)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_13)
   goals met: 1 of 3
20. (op_3 obj_13 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_1) (pred_12 obj_18 obj_13)
   goals met: 2 of 3
21. (op_1 obj_13 obj_31)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_31)
   goals met: 2 of 3
22. (op_1 obj_31 obj_17)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_17)
   goals met: 2 of 3
23. (op_1 obj_17 obj_05)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_05)
   goals met: 2 of 3
24. (op_2 obj_05 obj_24)
   deleted: (pred_12 obj_24 obj_05) (pred_1)
   added: (pred_9 obj_24)
   goals met: 2 of 3
25. (op_1 obj_05 obj_17)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_17)
   goals met: 2 of 3
26. (op_1 obj_17 obj_31)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_31)
   goals met: 2 of 3
27. (op_1 obj_31 obj_13)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_13)
   goals met: 2 of 3
28. (op_1 obj_13 obj_07)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_07)
   goals met: 2 of 3
29. (op_1 obj_07 obj_32)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_32)
   goals met: 2 of 3
30. (op_3 obj_32 obj_24)
   deleted: (pred_9 obj_24)
   added: (pred_1) (pred_12 obj_24 obj_32)
   goals met: 3 of 3
